def main_menu():
    print("=" * 26)
    print("       Book Manager")
    print("=" * 26)
    
    print("1. Управление библиотекой")
    print("2. Управление читателями")
    print("0. Выход")

def authors_menu():
    print("-" * 26)
    print("   Управление библиотекой")
    print("-" * 26)
    print("1. Добавить автора")
    print("2. Добавить книгу")
    print("3. Удалить книгу")
    print("4. Показать книги")
    print("5. Найти книгу")
    print("6. Удалить книгу")
    print("7. Показать статистику")
    print("0. Назад")

def readers_menu():
    print("-" * 26)
    print("   Управление читателями")
    print("-" * 26)
    print("1. Добавить читателя")
    print("2. Показать читателей")
    print("3. Удалить читателя")
    print("4. Выдать книгу")
    print("5. Вернуть книгу")
    print("6. Показать статистику")
    print("0. Назад")
